#include <iostream>
using namespace std;

int main(){
    int a=125;         // a хувьсагчид 125 утга оноож байна
    int *p = &a;       // p хаяган хувьсагчид a хувьсагчийн хаягийг оноож байна

    cout<<p<<endl;     // p ийн утга буюу а ийн санах ойн хаягийг хэвлэж байна
    cout<<*p<<endl;    // p хаяган хувьсагч дээр байх а хувьсагчийн утгыг хэвлэж байна
    p++;               // p ийн утгыг нэгээр нэмж байна
    cout<<p<<endl;     // p ийн шинэ утга буюу а ийн утга өмнөх санах ойн хаяг дээр 1 буюу 4 bytes нэмж байна
    cout<<*p<<endl;    // шинээр үүссэн p хаяган хувьсагчид харгалзах a ийн утгыг хэвлэж байна
}
