#include <iostream>
using namespace std;

int main(){
  int numbers[5];              // int төрлийн 5 хэмжээтэй хүснэгт үүсгэв
  int * p;                     // int төрлийн p хаяган хувьсагч зарлав
  p = numbers;                 // p хаяган хувьсагчийг numbers хүснэгтийн хамгийн эхний элементийн хаягт хадгална
  *p = 10;                     // дараа нь p ийн утгыг 10 болгоно
  p++;                         // p ийн утгыг нэгээр нэмснээр numbers хүснэгтийн 2 элементийн хаягт хадгална
  *p = 20;                     // дараа нь p ийн утгыг 20 болгоно
  p = &numbers[2];             //p хувьсагчийг numbers хүснэгтийн 2дох элементийн хаягийг зааж өгнө
  *p = 30;                     // дараа нь p ийн утгыг 30 болгоно
  p = numbers + 3;             //p хувьсагчийг numbers хүснэгтийн 4дэх элементийн хаягийг зааж өгнө
  *p = 40;                     // дараа нь p ийн утгыг 40 болгоно
  p = numbers;                 // ахин p хаяган хувьсагчийг numbers хүснэгтийн хамгийн эхний элементийн хаягт хадгална
  *(p+4) = 50;                 // numbers хүснэгтийн 4 дэх элементийг утгыг 50 болгоно
  for (int n=0; n<5; n++)      // for давталт ашиглан numbers хүснэгтийн бүх элементийг хэвлэнэ
    cout << numbers[n] << ", ";
}